import discord
import random
from discord.ext import commands

client = commands.Bot(command_prefix = '.')

@client.event
async def on_ready():
    print('Kunjappan is live')

@client.event
async def on_member_join(member):
    print(f'{member} jas joined the server')

@client.event
async def on_member_remove(member):
    print(f'{member} has left the server')

@client.command()
async def ping(ctx):
    await ctx.send(f'{round(client.latency *1000)} ms')

@client.command(aliases=['para', 'vallom para', 'kunja'])
async def diag(ctx, *, question):
    resposes = ['തീർച്ചയായും ഷൈജു ',
                'നന്ദി. വീണ്ടും വരിക.',
                'അയ്യോ',
                'എന്നെ കൊണ്ട് പറ്റുമെന്ന് തോന്നുന്നില്ല ഷാജിയേട്ടാ',
                'ഇപ്പൊ പറയാൻ പറ്റില്ല. മാർച്ച് 35 നു പറയാം.',
                'സവാരി ഗിരി ഗിരി',
                'അറിയാന്മേലാഞ്ഞിട്ട് ചോദിക്കുവാ ... നീ ആരുവാ ...',
                'ഇനി അഥവാ ബിരിയാണി കിട്ടിയാലോ...',
                'ഞാൻ ഒന്ന് തിരുവന്തോരത്തെക്ക് വിളിച്ചു നോക്കട്ടെ ',
                'നീ പോടാ ... നീ പണ്ടേ ഉടായിപ്പാ',
                'അങ്ങ് പള്ളിൽ പോയി പറഞ്ഞാൽ മതി ',
                'ആ ... പോ ....',
                'തനിക്കൊന്ന് കുളിച്ചൂടെ? നാറിയിട്ട് പാടില്ല.',
                'ആനക്കാര്യത്തിനിടയിലാണോ ചേനക്കാര്യം',
                'തമ്പുരാനറിയാം',
                'എല്ലാരോടും ആയിട്ട് പറയുവാ...  ബുദ്ധിയില്ലാത്ത കുട്ടിയാ... ക്ഷമിച്ചു കള...',
                'ഞാൻ നിൻറെ തന്തയാടാ തന്ത',
                'ഇഞ്ചിമുട്ടായി',
                'നമ്മളില്ലേ',
                'ഇന്നിപ്പോ സമയമില്ല, നിനക്ക് അടുത്ത വെള്ളിയാഴ്ച്ച മറുപടി തരാം',
                'ഭയങ്കരം തന്നെ',
                'മുതലാളി ഒരു ചെറ്റയാണ്',
                'ഛെ!! കൽച്ചർലസ്സ് ഫെല്ലോ.',
                'നിൻറെ തലയിൽ ഇടിത്തീ വീഴുമെടാ കാലമാടാ ',
                'ഞാൻ ഒരു പാവം അല്ലെ ... എന്നെ ഇങ്ങനെ ഉപദ്രവിക്കാമോ...',
                'ഞാൻ ഒരുമ്മ തന്നാൽ പ്രശ്നം തീരുമോ',
                'ഈ സെർവർ പഴയ സെർവരല്ലെന്നറിയാം, പക്ഷെ കുഞ്ഞപ്പൻ പഴയ കുഞ്ഞപ്പൻ തന്നെയാ ',
                'മുഖ്യമന്ത്രി രാജി വെക്കണം',
                'നേരെ പോയി വലത്തോട്ട് തിരിഞ്ഞാൽ ഊളംപാറയാ .... അവിടെ ചോദിച്ചാൽ മതി ',
                'ഓരോരോ പട്ടിത്തീട്ടങ്ങളെ ',
                'എന്താ നിന്റെ പ്രശ്നം ചക്കരേ',
                'അയ്യടാ... അങ്ങനത്തെ വൃത്തികെട്ട പരിപാടിക്കൊന്നും എന്നെ കിട്ടില്ല ... ഞാൻ കുടുംബത്തിൽ പിറന്നതാ ',
                'ഉളുപ്പില്ലേ ']
    await ctx.send(f'{random.choice(resposes)}')




client.run('NjU3OTEzNTU5MzgwMDAwNzkz.XgCaiQ.SDbW3L7QE-wm76f-re_cmosqSEw')
